#+FILETAGS: :Tn:
*** DONE [#B] Learn how to track calories, and money with hledger
CLOSED: [2024-02-25 Sun 17:05]
:LOGBOOK:
- State "DONE"       from "INPROGRESS" [2024-02-25 Sun 17:05]
- State "INPROGRESS" from "NEXT"       [2024-02-23 Fri 09:25]
CLOCK: [2024-02-20 Tue 19:47]--[2024-02-20 Tue 20:27] =>  0:40
:END:
*** DONE [#B] Fix Org-Journal Hydras and integrate with org-capture and refile
CLOSED: [2024-02-21 Wed 20:26]
:LOGBOOK:
- State "DONE"       from "WAITING"    [2024-02-21 Wed 20:26]
CLOCK: [2024-02-19 Mon 16:50]--[2024-02-19 Mon 16:54] =>  0:04
:END:
***** DONE [#B] Refactor =ongoing tasks= file
CLOSED: [2024-02-21 Wed 19:30]
:LOGBOOK:
- State "DONE"       from "TODO"       [2024-02-21 Wed 19:30]
CLOCK: [2024-02-21 Wed 19:11]--[2024-02-21 Wed 19:30] =>  0:19
:END:
To store todo headings of recurring tasks.
- [X] eating
- [X] sleeping
- [X] Hanging out with tobey
- [X] ect
***** DONE [#B] create ongoing tasks hydra
CLOSED: [2024-02-21 Wed 20:26]
:LOGBOOK:
- State "DONE"       from "TODO"       [2024-02-21 Wed 20:26]
CLOCK: [2024-02-21 Wed 19:30]--[2024-02-21 Wed 20:25] =>  0:55
:END:
used to quickly clock in ongoing tasks
***** DONE [#B] create quick captures with clocking
CLOSED: [2024-02-21 Wed 19:11]
:LOGBOOK:
- State "DONE"       from "TODO"       [2024-02-21 Wed 19:11]
CLOCK: [2024-02-21 Wed 18:31]--[2024-02-21 Wed 19:11] =>  0:40
CLOCK: [2024-02-21 Wed 18:23]--[2024-02-21 Wed 18:29] =>  0:06
CLOCK: [2024-02-21 Wed 17:59]--[2024-02-21 Wed 18:21] =>  0:22
CLOCK: [2024-02-21 Wed 17:57]--[2024-02-21 Wed 17:58] =>  0:01
CLOCK: [2024-02-21 Wed 17:49]--[2024-02-21 Wed 17:56] =>  0:07
CLOCK: [2024-02-21 Wed 17:34]--[2024-02-21 Wed 17:48] =>  0:14
CLOCK: [2024-02-21 Wed 17:16]--[2024-02-21 Wed 17:22] =>  0:06
CLOCK: [2024-02-21 Wed 17:15]--[2024-02-21 Wed 17:16] =>  0:01
CLOCK: [2024-02-21 Wed 17:14]--[2024-02-21 Wed 17:15] =>  0:01
CLOCK: [2024-02-21 Wed 17:02]--[2024-02-21 Wed 17:13] =>  0:11
CLOCK: [2024-02-21 Wed 16:55]--[2024-02-21 Wed 16:57] =>  0:02
CLOCK: [2024-02-21 Wed 16:46]--[2024-02-21 Wed 16:49] =>  0:03
CLOCK: [2024-02-21 Wed 14:22]--[2024-02-21 Wed 15:28] =>  1:06
CLOCK: [2024-02-21 Wed 12:25]--[2024-02-21 Wed 12:47] =>  0:22
CLOCK: [2024-02-21 Wed 12:04]--[2024-02-21 Wed 12:24] =>  0:20
:END:
capture short interuptions
- [X] Talking with Tobey
- [X] bathroom
- [X] refilling water
- [X] ect
*** DONE [#B] Fix Org-Roam Hydras
CLOSED: [2024-02-21 Wed 11:04]
:LOGBOOK:
- State "DONE"       from "TODO"       [2024-02-21 Wed 11:04]
CLOCK: [2024-02-21 Wed 10:08]--[2024-02-21 Wed 11:04] =>  0:56
:END:
- [X] Check ability to insert SFW nodes
- [X] Add ability to insert NSFW nodes
- [X] Figure out it Citar suggestions can be sorted by tag from hydra
- [X] Citar index sort by SFW / NSFW
- [X] Move shopping list to internal section
- [X] Add insert with priority to (C-M-<RET>)
*** DONE [#B] Refine Org-Agenda configuration
CLOSED: [2024-02-20 Tue 19:15]
:LOGBOOK:
- State "DONE"       from "TODO"       [2024-02-20 Tue 19:15]
CLOCK: [2024-02-20 Tue 11:25]--[2024-02-20 Tue 14:01] =>  2:36
:END:
- [X] Simplified and Minimal Daily view
- [X] Minimal Rolling Future 10 day view
- [X] Comprehensive 3 day view, of day surrounding a future date
- [X] Categorized Global TODO list
- [X] Start Up landing screen with Daily view next to Current days journal entry
*** DONE [[https://github.com/nobiot/org-transclusion#original-idea-by-john-kitchin][Org Transclusion]]
CLOSED: [2024-02-19 Mon 18:34]
:LOGBOOK:
- State "DONE"       from "TODO"       [2024-02-19 Mon 18:34]
CLOCK: [2024-02-19 Mon 18:30]--[2024-02-19 Mon 18:34] =>  0:04
:END:
*** DONE Org Flash Cards
CLOSED: [2024-02-19 Mon 18:40]
:LOGBOOK:
- State "DONE"       from "TODO"       [2024-02-19 Mon 18:40]
CLOCK: [2024-02-19 Mon 18:35]--[2024-02-19 Mon 18:40] =>  0:05
:END:
- https://www.reddit.com/r/emacs/comments/i0n100/is_there_a_way_to_transform_orgroam_files_to_anki/
- org fc
